app/controllers/service_providers_controller.rb

  def index
    @service_providers = ServiceProvider.all
---
SELECT "service_providers".* FROM "service_providers" ORDER BY "service_providers"."created_at" DESC

  def create
    @service_provider = ServiceProvider.new(service_provider_params)

    respond_to do |format|
      if @service_provider.save
---
INSERT INTO "service_providers" ("name", "address", "telephone", "email", "acc_number", "active", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @service_provider.update(service_provider_params)
---
UPDATE "service_providers" SET "address" = ?, "updated_at" = ? WHERE "service_providers"."id" = ?  [["address", "Suite 1, Beaver House, Beech Hill Office Campus Clonskeagh, Dublin, D04 Y8X5"], ["updated_at", "2018-10-07 20:49:32.169463"], ["id", 4]]

    def set_service_provider
      @service_provider = ServiceProvider.find(params[:id])
---
SELECT  "service_providers".* FROM "service_providers" WHERE "service_providers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]